JaidenK/HydroponicsAutomation/Designs/Software/Embedded/PSoC/HydroponicAutomationSensorPerf.cydsn/Generated_Source/PSoC5/PingSensorControl.h
/*******************************************************************************
* File Name: PingSensorControl.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_PingSensorControl_H) /* CY_CONTROL_REG_PingSensorControl_H */
#define CY_CONTROL_REG_PingSensorControl_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} PingSensorControl_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    PingSensorControl_Write(uint8 control) ;
uint8   PingSensorControl_Read(void) ;

void PingSensorControl_SaveConfig(void) ;
void PingSensorControl_RestoreConfig(void) ;
void PingSensorControl_Sleep(void) ; 
void PingSensorControl_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define PingSensorControl_Control        (* (reg8 *) PingSensorControl_Sync_ctrl_reg__CONTROL_REG )
#define PingSensorControl_Control_PTR    (  (reg8 *) PingSensorControl_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_PingSensorControl_H */


/* [] END OF FILE */
